<?php

namespace App\Helpers;

class StringHelper
{
    public static function generateRandomString($length = 10)
    {
        $characters = '0123456789abcdefghijklmnopqrstuvwxyz';
        $charactersLength = strlen($characters);
        $randomString = '';
        for ($i = 0; $i < $length; $i++) {
            $randomString .= $characters[rand(0, $charactersLength - 1)];
        }
        return $randomString;
    }

    public static function slugify($str, $delimiter = '.')
    {
        $str = self::sanitize($str, $delimiter);
        $str = strtolower(trim(preg_replace('/[^A-Za-z0-9-]+/', $delimiter, $str), $delimiter));

        return $str . $delimiter . self::generateRandomString(5);
    }

    public static function sanitize($title, $delimiter)
    {
        $map = array();
        $quotedReplacement = preg_quote($delimiter, '/');
        $default = array(
            '/à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ|À|Á|Ạ|Ả|Ã|Â|Ầ|Ấ|Ậ|Ẩ|Ẫ|Ă|Ằ|Ắ|Ặ|Ẳ|Ẵ|å/' => 'a',
            '/è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ|È|É|Ẹ|Ẻ|Ẽ|Ê|Ề|Ế|Ệ|Ể|Ễ|ë/' => 'e',
            '/ì|í|ị|ỉ|ĩ|Ì|Í|Ị|Ỉ|Ĩ|î/' => 'i',
            '/ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ|Ò|Ó|Ọ|Ỏ|Õ|Ô|Ồ|Ố|Ộ|Ổ|Ỗ|Ơ|Ờ|Ớ|Ợ|Ở|Ỡ|ø/' => 'o',
            '/ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ|Ù|Ú|Ụ|Ủ|Ũ|Ư|Ừ|Ứ|Ự|Ử|Ữ|ů|û/' => 'u',
            '/ỳ|ý|ỵ|ỷ|ỹ|Ỳ|Ý|Ỵ|Ỷ|Ỹ/' => 'y',
            '/đ|Đ/' => 'd',
            '/ç/' => 'c',
            '/ñ/' => 'n',
            '/ä|æ/' => 'ae',
            '/ö/' => 'oe',
            '/ü/' => 'ue',
            '/Ä/' => 'Ae',
            '/Ü/' => 'Ue',
            '/Ö/' => 'Oe',
            '/ß/' => 'ss',
            '/[^\s\p{Ll}\p{Lm}\p{Lo}\p{Lt}\p{Lu}\p{Nd}]/mu' => ' ',
            '/\\s+/' => $delimiter,
            sprintf('/^[%s]+|[%s]+$/', $quotedReplacement, $quotedReplacement) => '',
        );
        //Some URL was encode, decode first
        $title = urldecode($title);
        $map = array_merge($map, $default);

        return strtolower(preg_replace(array_keys($map), array_values($map), $title));
    }

    public static function stringToEmoji($str)
    {
        $emojis = [
            'o/' => '👋',
            '</3' => '💔',
            '<3' => '💗',
            '8-D' => '😁',
            '8D' => '😁',
            ':-D' => '😁',
            '=-3' => '😁',
            '=-D' => '😁',
            '=3' => '😁',
            '=D' => '😁',
            'B^D' => '😁',
            'X-D' => '😁',
            'XD' => '😁',
            'x-D' => '😁',
            'xD' => '😁',
            ':\')' => '😂',
            ':\'-)' => '😂',
            ':-))' => '😃',
            '8)' => '😄',
            ':)' => '😄',
            ':-)' => '😄',
            ':3' => '😄',
            ':D' => '😄',
            ':]' => '😄',
            ':^)' => '😄',
            ':c)' => '😄',
            ':o)' => '😄',
            ':}' => '😄',
            ':っ)' => '😄',
            '=)' => '😄',
            '=]' => '😄',
            '0:)' => '😇',
            '0:-)' => '😇',
            '0:-3' => '😇',
            '0:3' => '😇',
            '0;^)' => '😇',
            'O:-)' => '😇',
            '3:)' => '😈',
            '3:-)' => '😈',
            '}:)' => '😈',
            '}:-)' => '😈',
            '*)' => '😉',
            '*-)' => '😉',
            ':-,' => '😉',
            ';)' => '😉',
            ';-)' => '😉',
            ';-]' => '😉',
            ';D' => '😉',
            ';]' => '😉',
            ';^)' => '😉',
            ':-|' => '😐',
            ':|' => '😐',
            ':(' => '😒',
            ':-(' => '😒',
            ':-<' => '😒',
            ':-[' => '😒',
            ':-c' => '😒',
            ':<' => '😒',
            ':[' => '😒',
            ':c' => '😒',
            ':{' => '😒',
            ':っC' => '😒',
            '%)' => '😖',
            '%-)' => '😖',
            ':-P' => '😜',
            ':-b' => '😜',
            ':-p' => '😜',
            ':-Þ' => '😜',
            ':-þ' => '😜',
            ':P' => '😜',
            ':b' => '😜',
            ':p' => '😜',
            ':Þ' => '😜',
            ':þ' => '😜',
            ';(' => '😜',
            '=p' => '😜',
            'X-P' => '😜',
            'XP' => '😜',
            'd:' => '😜',
            'x-p' => '😜',
            'xp' => '😜',
            ':-||' => '😠',
            ':@' => '😠',
            ':-.' => '😡',
            ':-/' => '😡',
            ':/' => '😡',
            ':L' => '😡',
            ':S' => '😡',
            ':\\' => '😡',
            '=/' => '😡',
            '=L' => '😡',
            '=\\' => '😡',
            ':\'(' => '😢',
            ':\'-(' => '😢',
            '^5' => '😤',
            '^<_<' => '😤',
            'o/\\o' => '😤',
            '|-O' => '😫',
            '|;-)' => '😫',
            ':###..' => '😰',
            ':-###..' => '😰',
            'D-\':' => '😱',
            'D8' => '😱',
            'D:' => '😱',
            'D:<' => '😱',
            'D;' => '😱',
            'D=' => '😱',
            'DX' => '😱',
            'v.v' => '😱',
            '8-0' => '😲',
            ':-O' => '😲',
            ':-o' => '😲',
            ':O' => '😲',
            ':o' => '😲',
            'O-O' => '😲',
            'O_O' => '😲',
            'O_o' => '😲',
            'o-o' => '😲',
            'o_O' => '😲',
            'o_o' => '😲',
            ':$' => '😳',
            '#-)' => '😵',
            ':#' => '😶',
            ':&' => '😶',
            ':-#' => '😶',
            ':-&' => '😶',
            ':-X' => '😶',
            ':X' => '😶',
            ':-J' => '😼',
            ':*' => '😽',
            ':^*' => '😽',
            'ಠ_ಠ' => '🙅',
            '*\\0/*' => '🙆',
            '\\o/' => '🙆',
            ':>' => '😄',
            '>.<' => '😡',
            '>:(' => '😠',
            '>:)' => '😈',
            '>:-)' => '😈',
            '>:/' => '😡',
            '>:O' => '😲',
            '>:P' => '😜',
            '>:[' => '😒',
            '>:\\' => '😡',
            '>;)' => '😈',
            '>_>^' => '😤',
        ];

        return strtr($str, $emojis);
    }
}
